import { CharacterDescriptionI18N } from "..";

export const ZHDescriptionI18N: CharacterDescriptionI18N = {
  HUNTER:
    "你在死亡后可以选择开枪杀死任意一名玩家，但若是被女巫毒死则无法使用此技能。每晚你会醒来查看自己的开枪状态。",
  GUARD:
    "你每晚可以保护一名角色（包括自己）不被狼人伤害，但不能连续两天守护同一个人。若你守护的人同时被女巫施用了灵药，他还是会死亡。",
  // HOST: "主持人",
  SEER: "每晚可以查验一名角色是否为狼人。",
  SHERIFF:
    "在白天的放逐投票中，你选择的人将获得 1.5 票。在你死后，可以选择指派任意玩家继任警长，也可以销毁警徽（如果这么做，村庄将再也不会有警长了）。",
  VILLAGER: "你是一名普通村民，没有特殊能力，但可以发挥你的推理，找出狼人！",
  WEREWOLF:
    "你是一个狼人，每晚你将和同伴一起苏醒，投票选择一名玩家将其杀害。你的目标是杀死所有非狼人角色！",
  WITCH:
    "你有两瓶药。第一瓶是灵药，当你未使用过它时，每晚你都将察觉到谁被狼人杀害了，你可以使用灵药来救活他；第二瓶是毒药，你可以使用它杀死任意一名玩家。游戏中，灵药毒药各只能使用一次。每晚你最多只能使用一瓶药。只有第一晚你可以使用灵药救自己。",
  "": "",
};
